{"version":"1.0","contentType":"text/markdown; charset=UTF-8","content":"Generally, the [types of architecture roles<sup>&#11127;</sup>](https://iasaglobal.org/itabok-1/engagement-model/role-descriptions/), fall into these categories:\r\n\r\n### Enterprise Architecture\r\n\r\nThe Enterprise Architect has mastered the fundamental skills in architecture and has been a practicing professional\r\narchitect within one of the specializations prior to moving into the enterprise architecture\r\npractice. The enterprise architect has learned enough of the specializations to lead the\r\narchitecture teams within an organization. Enterprise architects will have functioned as a\r\nsolutions architect to the extent necessary to lead at the enterprise or global level. To be\r\nan enterprise architect, a successful candidate will have learned the value of the existing\r\nspecializations and proven their ability to lead the cross-functional architecture teams to\r\nsuccess.\r\n\r\n### Solution Architecture\r\n\r\nThe Solution Architect has mastered the fundamental skills in architecture and has been a practicing architect\r\nwithin delivery based organization. The solution architect is responsible for delivery on\r\none or more projects within the scope of the business case for the solution. Their primary\r\nrole is to optimize the value of a solution to an organization through delivery and reduce\r\nowner risk in its delivery while ensuring the solution meets all compliance and regulatory\r\nwhich impact the system. The solution architect will work with specialist architects,\r\ntechnical staff and stakeholders of the solution to ensure it is delivered or canceled based\r\non the most effective strategy for the organization as a whole.\r\n\r\n### Business Architecture\r\n\r\nThe Business Architect provides leadership of business initiatives through technology strategy by participating in\r\nthe development of a business strategy to accomplish specific business goals. They provide\r\ninnovation and opportunity recognition within business units. Specifically the business\r\narchitect has mastered the delivery of value through technology support of business\r\nstrategy. The business architect has developed their understanding of business valuation,\r\nbusiness process and business strategy delivery. They act as a liaison from the technology\r\ngroups to enhance business development and have tremendously advanced skills in business\r\nvaluation of technology as well has human dynamics.\r\n\r\n### Information Architecture\r\n\r\nThe Information Architect directs the use, integration and storage of information within a particular business unit\r\n(vertical structure) or business capability (horizontal structure). The information\r\narchitect may focus in on one particular form such as usage focused strategy, information\r\nstorage or other elements of information architecture or but must consider all elements of\r\ninformation architecture in the organization or customer base. The information architect has\r\nmastered the management of information across and within their industry.\r\n\r\n### Infrastructure Architecture\r\n\r\nThe Infrastructure Architect provides strategic uses of infrastructure, network, and operations as an asset. They create\r\nand deliver technology strategies to optimize the use of technology resources related to\r\nhardware and physical system. It should be noted, this is not meant as quantitative overlap\r\nwith the upcoming physical system architect who focuses on highly complex physical systems\r\nengineering domains such as satellite, defense, and embedded technology though there is some\r\noverlap. The infrastructure architect uses their mastery of network, computing platform and\r\noperations to guide the organization to valuable investments in hardware and platform.\r\n\r\n### Software Architecture\r\n\r\nThe Software Architect has mastered the value, use, development and delivery of software intensive systems. They\r\nhave developed skills in software development lifecycles, software engineering and software\r\ndesign. The software architect is responsible for the value generated from software systems\r\nor system of systems within their direct supervision. They work with project teams to ensure\r\nvalue is delivered for investment and feed resulting valuation results into the business,\r\ninformation and infrastructure areas.\r\n"}